import { ResourceItem } from "@/lib/data_types";

export const data: ResourceItem[] = [
  {
    id: "1",
    name: "沉浸式日出漫游",
    url: "https://mp.weixin.qq.com/s/ynE3FMOKKMft2xIAXmqBwg",
    desc: "用图文带你看日出是什么体验，本篇交出完美答案。在图文中打造一场日出胜景，通过读者的滑动，触发黑暗的画面被点亮发光，真实还原了一次“追光”之旅。交互体验与设计美感齐飞，又是一篇引人入胜的佳作。",
  },
  {
    id: "2",
    name: "东方美学的艺术品",
    url: "https://mp.weixin.qq.com/s/bzV3DSHlyOpBPMZrg-AypA",
    desc: "整个项目放大了用户触觉、听觉、嗅觉、味觉的感受，调动多种感官体验，打造一个独具东方韵味的昆仑庭院，让每一个参与其中的用户获得“沉浸式游览昆仑庭院”的极致享受。",
  },
  {
    id: "3",
    name: "学术报告新写法",
    url: "https://mp.weixin.qq.com/s/hBjUqN6ziZU-NJFMfPKbhQ",
    desc: "如何深入浅出的向用户展示学术性、大体量的内容？这篇文章我们选择用拟态脑图的形式以直观形象的方式进行表达和思考,接近人的自然思维过程，帮助用户厘清报告的内在逻辑，快速获取信息，减轻阅读压力。拟态脑图的设计，既让报告内容清晰明了，又不失专业之感，是总结、报告、规划介绍类图文的绝佳选择。",
  },
  {
    id: "4",
    name: "SVG 的弹幕群",
    url: "https://mp.weixin.qq.com/s/3nor_2N8bzY7GO-sqPWPQg",
    desc: "本篇图文案例中，我们用排山倒海延绵不绝的「滚动弹幕群」，向读者呈现了 792 位职场新人给职场提出建议，让我们直面无数职场新人张嘴向我们输出建议的冲击。任意点击漂浮着的弹幕还可以弹出相应的专业建议海报。",
  },
  {
    id: "5",
    name: "恋爱是一场人生游戏",
    url: "https://mp.weixin.qq.com/s/qdjm_7f9I0FgIQzu7JJAVQ",
    desc: "一个是让人又爱又恨的扫雷游戏，一个是男生女生相处之间的吸引和摩擦，将这两者巧妙结合生出了虎嗅七夕的游戏化扫雷推文。用户通过点击⽅块去“排雷”，点击安全⽅块，弹窗⼀句恋爱的避雷指南，指南⽂案以男⽣视⻆出发，提醒男⽣在恋爱中避免⼀些⾏为。",
  },
  {
    id: "6",
    name: "一镜到底的丝滑体验",
    url: "https://mp.weixin.qq.com/s/fT_diMZds2WTiEDirxPfKw",
    desc: "从杯身的 logo 探入，在充满古气息和东方韵味的国风版画场景间丝滑穿梭，一层接一层的连续深入将文章的层次感和空间感表现的淋漓尽致。最后，茶叶涌入铺满屏幕，将读者拉回现实空间。一进一出间，完成了这场如梦似幻的沉浸式探索旅程。",
  },
  {
    id: "7",
    name: "与 GQ 探索新中式美学",
    url: "https://mp.weixin.qq.com/s/8rJlCVVWIAXjEdgka84TGQ",
    desc: "选取美丽的意向与被推荐产品的设计理念完美融合，点击画面触发动效，花瓣散落、云雾散去、窗棂翻转、候鸟飞过、秋千摇曳... 随后露出隐藏的文字信息，让读者停下脚步，欣赏美好的事物。用最普通的交互形式，把文章做的美出新高度，提醒人们，即使生活匆匆，依旧繁花似锦。",
  },
  {
    id: "8",
    name: "互动式解读 ESG",
    url: "https://mp.weixin.qq.com/s/mY2ZJlDKIrzQAfXZKpAPqA",
    desc: "选择拟态 Word 文档页面为信息载体，以强大的SVG技术支持，模拟真实的操作流程，引导读者参与互动，自主在年报中插入图片。根据读者的选择，生成最后的结果，平等的给每位读者一个撰写支付宝年报的机会。如此一来，年报上陈列着的密密麻麻描述年度成就的文字、冰冷的业绩数据在互动中变得生动有趣了起来，用娱乐性的方式把助实成果讲述的深入人心。",
  },
  {
    id: "9",
    name: "就让这红包雨全都落下",
    url: "https://mp.weixin.qq.com/s/5TTiRqAQgVZGMJHeCTBiyQ",
    desc: "在常态化的图文中如何破圈？本篇推文打造了一场红包雨，利用视差滑动呈现一个个红包，让日常化的主题推文也焕发新的爆点。创意与高质量无疑是撬动新玩法的绝佳杠杆。",
  },
  {
    id: "10",
    name: "用形式发声",
    url: "https://mp.weixin.qq.com/s/VlqDVyFFn8cxzVTH3b2Scg",
    desc: "在「媒介即信息」时代，作品的形式已经成为了表达的一部分，符号作为不断挖掘 SVG 更多可能性的开拓者，坚持为每一种观点寻找最适配的呈现形式，用技术为值得传播的内容扩音。这这篇妇女节的图文案例中，读者可以通过滑动去掉建立在刻板印象上的前置条件，粉碎掉女性长期受到的恶意解读，争取无需粉饰的自由表达，用最纯粹的角度去听见、去看见、去了解这广大世界上普通的千万女性。",
  },
];
